Revit 2027 API
BuiltInFailures.SketchFailures.LandingNotEnoughBoundaryCurves Property
 Sketch landing require boundaries
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LandingNotEnoughBoundaryCurves { get; }
Public Shared ReadOnly Property LandingNotEnoughBoundaryCurves As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LandingNotEnoughBoundaryCurves {
	FailureDefinitionId^ get ();
}
static member LandingNotEnoughBoundaryCurves : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace